# Pandas
* 시계열(Series)을 나타내는 `Series` 클래스 제공
* 표(table) 형태를 나타내는 `DataFrame` 클래스 제공

In [1]:
import pandas as pd

# 1. Series 클래스

* Series는 NumPy에서 제공하는 1차원 배열과 비슷
* 시리즈(Series) = 값(value) + 인덱스(index)
    * index를 붙일 수 있다.

## 1.2. Series 생성
* 리스트 or 1차원 배열 형식으로 `Series` 클래스 생성자에 넣으면 `Series` 클래스 객체를 만들 수 있다.
* 인덱스의 값인 **인덱스 라벨(label)**은 문자열, 날짜, 시간, 정수 등도 가능

In [5]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
             index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [6]:
# 인덱스 라벨 미지정 시 정수 인덱스
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

##### index
시리즈 인덱스에 접근

In [7]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

##### values
시리즈의 값
    * 시리즈의 값은 1차원 배열

In [9]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

##### name
시리즈 데이터에 이름 붙이기

In [10]:
s.name = "인구"
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

##### index.name
시리즈 인덱스에 이름 붙이기

In [11]:
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

## 1.3. Series 연산
NumPy 배열처럼 Series도 벡터화 연산 가능
* 연산은 시리즈 값에만 적용됨 (인덱스 라벨은 미변화)

In [12]:
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

## 1.4. Series 인덱싱
* NumPy 배열에서 가능한 인덱스 방법 이외 인덱스 라벨을 이용해 인덱싱 가능
* 배열 인덱싱이나 인덱스 라벨을 이요한 슬라이싱도 가능

In [13]:
s[1], s["부산"]

(3448737, 3448737)

배열 인덱싱을 하면 자료의 순서 변경 또는 특정한 자료만 선택 가능

In [14]:
s[[0, 3, 1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [16]:
s[["서울", "대구", "부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [17]:
s[(250e4 < s) & (s < 500e4)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

문자열 라벨 슬라이싱의 경우 콜론(:) 뒤 오는 인덱스의 값도 결과에 포함된다.

In [18]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [19]:
s["부산":"대구"]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

라벨이 영문 문자일 경우 속성처럼 점(.)으로 접근 가능하다.

In [20]:
s0 = pd.Series(range(3), index=["a", "b", "c"])
s0

a    0
b    1
c    2
dtype: int64

In [21]:
s0.a

0

In [22]:
s0.b

1

## 1.5. Series와 딕셔너리 자료형
시리즈 객체는 라벨 값을 Key로 가지는 딕셔너리 자료형과 같다고 볼 수 있다.  
따라서 딕셔너리 자료형에서 제공하는 `in` 연산도 가능하고 `item` 메서드를 사용해 `for` 루프를 통한 각 원소의 key와 value에 접근할 수 있다.

In [23]:
"서울" in s

True

In [24]:
"대전" in s

False

In [25]:
for k, v in s.items():
    print("%s = %d" % (k, v))

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

### 1.5.1. 딕셔너리로 Series 생성

In [26]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

딕셔너리 원소는 순서가 없어 시리즈 데이터도 순서 보장이 안 됨
* 인덱스를 리스트로 지정해 순서 지정이 가능

### 1.5.2. 딕셔너리로 순서있는 Series 생성

In [27]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
              index=["부산", "서울", "인천", "대전"])
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

## 1.6. 인덱스 기반 연산
2개의 시리즈 연산 시 인덱스가 같은 데이터에 대해서만 연산한다.

In [29]:
# 2015년도와 2010년 인구 증가 계산
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [30]:
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [31]:
ds = s - s2
ds

# NaN : Not a Number
# NaN이 float 자료형에서만 가능하여 다른 계산 결과 모두 float형이 됨

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [32]:
s.values - s2.values

array([ 6511121, -6182745,   258416,   975894], dtype=int64)

##### notnull
`NaN`이 아닌 값 구하기

In [33]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [34]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [35]:
# 인구 증가율(%)
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

## 1.7. 데이터 갱신, 추가, 삭제

### 1.7.1. 갱신

In [37]:
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

### 1.7.2. 추가

In [38]:
rs["대구"] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

### 1.7.3. 삭제

In [39]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

# Series 연습문제
1. 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

In [128]:
s1 = pd.Series(range(5), index=["1st", "2nd", "3rd", "4th", "5th"])
s1

1st    0
2nd    1
3rd    2
4th    3
5th    4
dtype: int64

In [130]:
s2 = pd.Series(range(5), index=["3rd", "4th", "5th", "6th", "7th"])
s2

3rd    0
4th    1
5th    2
6th    3
7th    4
dtype: int64

2. 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [132]:
s3 = s1 + s2
s3

1st    NaN
2nd    NaN
3rd    2.0
4th    4.0
5th    6.0
6th    NaN
7th    NaN
dtype: float64

In [134]:
s3[s3.notnull()]

3rd    2.0
4th    4.0
5th    6.0
dtype: float64

# 2. DataFrame 클래스
* 시리즈는 1차원 벡터 데이터에 행방향 인덱스(row index)를 붙인 것
* 데이터프레임 클래스는 2차원 행렬 데이터에 인덱스를 붙인 것
    * 행방향 인덱스(row index) 뿐 아니라 열방향 인덱스(column index)도 붙일 수 있다.

## 2.1. DataFrame 생성
데이터프레임 생성 방법
1. 하나의 열이 되는 데이터를 리스트나 1차원 배열로 준비한다.
2. 이 각각의 열에 대한 이름(label)을 키로 가지는 딕셔너리를 만든다.
3. 이 데이터를 `DataFrame` 클래스 생성자에 넣는다.
    * 동시에 열방향 익덱스는 `columns` 인수, 행방향 인덱스는 `index` 인수로 지정한다.

In [41]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

##### values
데이터에 접근

In [42]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

##### cloumns
열방향 인덱스 접근

In [43]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

##### index
행방향 인덱스 접근

In [44]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

##### index.names
행방향 인덱스 이름 붙이기

In [46]:
df.index.name = "도시"
df

     지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

##### columns.name
열방향 인덱스 이름 붙이기

In [47]:
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

##### T
전치(transpoes)
> 데이터프레임은 전치를 포함하여 NumPy 2차원 배열의 대부분의 속성, 메서드를 지원한다.

In [48]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

## 2.2. DataFrame 열 인덱싱
열 라벨(coumn lable)을 key값으로 생각해 인덱싱 가능
* 인덱스로 라벨 값 하나 넣을 시 시리즈 객체 반환
* 라벨의 배열, 리스트를 넣을 시 부분적인 데이터프레임 반환

In [49]:
df["지역"] # Series 반환

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [50]:
df[["2010","2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

데이터프레임 자료형을 유지한 채 하나의 열만 선택하려면, 원소가 하나인 리스트써서 인덱싱하면 된다.

In [53]:
df[["2010"]] # DataFrame 반환

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [54]:
type(df[["2010"]])

pandas.core.frame.DataFrame

In [55]:
type(df["2010"])

pandas.core.series.Series

열 인덱스가 문자열 라벨일 때 순서를 나타내는 정수 인덱스로 열 인덱싱 사용 불가

In [57]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [56]:
df[0]

KeyError: 0

열 인덱스가 정수형일 경우엔 가능

In [59]:
import numpy as np

df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [62]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int32

## 2.3. 열 데이터 갱신, 추가, 삭제
데이터프레임은 열 시리즈의 딕셔너리로 볼 수 있어 열 단위로 데이터 갱신, 추가, 삭제가 가능

### 2.3.1. 갱신

In [63]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

### 2.3.2. 추가

In [64]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

### 2.3.3. 삭제

In [65]:
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

## 2.4. 개별 데이터 인덱싱
데이터프레임에서 열 라벨로 시리즈를 인덱싱하고, 다시 행 라벨로 개별 데이터를 인덱싱 가능

In [66]:
df["2015"]["서울"]

9904312

## 2.5. 행 단위 인덱싱
행 단위로 인덱싱하려면 항상 슬라이싱을 해야 한다.
* 시리즈같이 라벨 슬라이싱도 가능

In [67]:
df[:1]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [69]:
df[1:3]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54

In [70]:
df["서울":"부산"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40

# DataFrame 연습문제

In [71]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

1. 모든 학생의 수학 점수를 시리즈로 나타낸다.

In [73]:
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

2. 모든 학생의 국어와 영어 점수를 데이터프레임으로 나타낸다.

In [74]:
df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

In [95]:
df["평균"] = (df["국어"] + df["영어"] + df["수학"])/3
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [93]:
avg = pd.DataFrame(np.sum(df, axis=1) / len(df.columns), columns=["평균"])
pd.concat([df, avg], axis=1)

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

4. 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

In [96]:
df["영어"]["방자"] = 80
df

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

5. 춘향의 점수를 데이터프레임으로 나타낸다.

In [109]:
df[:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

6. 향단의 점수를 시리즈로 나타낸다.

In [126]:
df.T["향단"]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64